Revit 2027 API
HermiteSplineTangents.EndTangent Property
 The tangent vector at the end of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ EndTangent { get; set; }
Public Property EndTangent As XYZ
	Get
	Set
public:
property XYZ^ EndTangent {
	XYZ^ get ();
	void set (XYZ^ value);
}
member EndTangent : XYZ with get, set
Property Value
XYZ
 This must be a nomalized unit vector.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
ArgumentOutOfRangeException |  When setting this property: endTangent has zero length.
InapplicableDataException |  The end tangent value is not set.
See Also
Reference
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace